# Компилируем Go‑пакет в исполняемый файл
build:
	go build -o bin/hexlet-path-size ./cmd/hexlet-path-size

# Запускаем линтер для проверки кода
lint:
	golangci-lint run

# Автоматически исправляем ошибки, которые может исправить линтер
lint-fix:
	golangci-lint run --fix

# Тестируем GetPathSize на файлы разного рамера (1024 байт, 2048 байт, 1536 байт, 512 байт),
# на директории (корневая директория с файлами первого уровня, поддиректория с одним файлом 512 байт,
# пустая директория), несуществующий путь (проверяет обработку ошибки «файл или директория не существует»),
# директория без прав доступа (проверяет обработку ошибки чтения директории), проверка, что поддиректории 
# не учитываются при подсчёте размера.
test:
	go test -v ./...